TextFile1.txt




<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"> <soap:Body>  <ProcessOperationsRequest xmlns="http://www.confirm.co.uk/schema/am/connector/webservice" >   <Request xmlns="">      <Authentication>     <Username>CSC</Username>     <Password>3nqu1re</Password>     <DatabaseId>Shropshire Council - Development</DatabaseId>      </Authentication>      <Operation>     <RequestId>1</RequestId>     <GetEnquiryLookups></GetEnquiryLookups>      </Operation>    </Request>  </ProcessOperationsRequest> </soap:Body></soap:Envelope>


{
  "ServiceType": "Highways"
  "RequestType":  "GetEnquiryLookupsRequest"
  "SourceSystem": "CRM",
  "SourceReference": "27710258-6904-40AE-BED9-B92EB97A26B3"
  "MessageDate": "2017-07-02T10:30:00"
  "MessageData":  {
  }
}

<IntegrationRequest><ServiceType>Highways</ServiceType><RequestType>GetEnquiryLookupsRequest</RequestType><SourceSystem>CRM</SourceSystem><SourceReference>27710258-6904-40AE-BED9-B92EB97A26B3</SourceReference><MessageDate>2017-07-02T10:30:00</MessageDate><MessageData /></IntegrationRequest>